#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@文件    :c12.py
@说明    :
@时间    :2020/09/23 14:59:08
@作者    :陆柏成
@版本    :1.0
@Email   :lu_baicheng@163.com
'''
import pandas as pd
df = pd.DataFrame({'区域' : ['西安', '太原', '西安', '太原', '郑州', '太原'], 
                  '10月份销售' : ['0.477468', '0.195046', '0.015964', '0.259654', '0.856412', '0.259644'],
                  '9月份销售' : ['0.347705', '0.151220', '0.895599', '0236547', '0.569841', '0.254784']})
# df.to_excel(123)
print(df['区域'].value_counts())
print(df.max())
